Revit 2027 API
BuiltInFailures.FormFailures.AddProfileFailure Property
 Failed to Add Profile
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AddProfileFailure { get; }
Public Shared ReadOnly Property AddProfileFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AddProfileFailure {
	FailureDefinitionId^ get ();
}
static member AddProfileFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FormFailures Class
Autodesk.Revit.DB Namespace